package com.github.binarywang.demo.wx.mp.utils;

import com.github.binarywang.demo.wx.mp.Service.LanternService;
import com.github.binarywang.demo.wx.mp.object.LanternEvent;
import com.github.binarywang.demo.wx.mp.object.Option;
import lombok.extern.slf4j.Slf4j;
import org.slf4j.Logger;
import org.slf4j.LoggerFactory;
import org.springframework.util.StringUtils;

import java.util.ArrayList;
import java.util.List;
import java.util.jar.JarEntry;

@Slf4j
public class LanternUtils {
    public static String totalPlainText = "{\"event\":\"你的一个元宵突然冒出了金光\",\"label\":\"#0000\",\"options\":[{\"option\":[\"哇！金色传说！\",\"元宵-1\",\"营业额+1w(或5w)\"]}]}\n" +
        "{\"event\":\"扇火太累睡着了，扇子起火，整个店烧起来\",\"label\":\"#0001\",\"options\":[{\"option\":[\"用水灭火\",\"营业额-5k\",\"营业额+5w\"]},{\"option\":[\"煮个鸡翅压压惊\",\"收益率+10%(或30%)\",\"元宵-3\"]}]}\n" +
        "{\"event\":\"火星溅射到一旁的元宵上\",\"label\":\"#0002\",\"options\":[{\"option\":[\"浇水灭火\",\"营业额-5k\"]},{\"option\":[\"静静看着元宵燃烧\",\"收益率+5%(或15%)\",\"营业额-1w(或5w)\"]}]}\n" +
        "{\"event\":\"心上人问你吃的是什么元宵\",\"label\":\"#0003\",\"options\":[{\"option\":[\"想你的相思元宵\",\"10分钟内收益率-50%\",\"10分钟内收益率+50%\"]},{\"option\":[\"泥油茅冰元宵\",\"“良心商家”称号3天\",\"营业额-5k\"]}]}\n" +
        "{\"event\":\"白胡子老头要买红橙黄绿青蓝紫七种颜色的元宵，于是你决定\",\"label\":\"#0004\",\"options\":[{\"option\":[\"只有白色，不买就算了\"]},{\"option\":[\"给他制作七彩元宵\",\"营业额+5w\"]}]}\n" +
        "{\"event\":\"你的店里来了一位相貌俊俏的男子说他被绿了，你决定\",\"label\":\"#0005\",\"options\":[{\"option\":[\"请他吃碗元宵\",\"幸运币+1\"]},{\"option\":[\"邦邦两拳\",\"元宵-3\"]}]}\n" +
        "{\"event\":\"黑市甚至一颗元宵一两黄金,时迁来偷你的元宵，你决定\",\"label\":\"#0006\",\"options\":[{\"option\":[\"给他一碗元宵吃\",\"换牌卡+1\"]},{\"option\":[\"邦邦两拳\",\"换将卡+1\"]}]}\n" +
        "{\"event\":\"宋江要拉你入伙，你决定\",\"label\":\"#0007\",\"options\":[{\"option\":[\"听他的话\",\"收益率-10%\"]},{\"option\":[\"邦邦两拳\",\"元宵-3\"]}]}\n" +
        "{\"event\":\"你穿越到镇关西的身上，遇到鲁提辖来买肉，你决定\",\"label\":\"#0008\",\"options\":[{\"option\":[\"给他做碗元宵\",\"烟花+10\"]},{\"option\":[\"邦邦两拳\",\"元宵-3\"]}]}\n" +
        "{\"event\":\"小混混来你店里收保护费，你决定\",\"label\":\"#0009\",\"options\":[{\"option\":[\"邦邦两拳\",\"清空元宵\"]},{\"option\":[\"请大圣来帮忙\",\"烟花+10\"]}]}\n" +
        "{\"event\":\"你救了老虎，老虎想要报答你\",\"label\":\"#0010\",\"options\":[{\"option\":[\"老虎决定以身相许\",\"收益率+25%\"]},{\"option\":[\"送给你一座金矿地图\",\"收益率-25%\"]}]}\n" +
        "{\"event\":\"一个神人说看广告可以煮好所有元宵\",\"label\":\"#0011\",\"options\":[{\"option\":[\"煮好所有元宵\",\"煮好所有元宵\"]},{\"option\":[\"无视他\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"火焰形态改变，元宵以肉眼可见的速度变熟\",\"label\":\"#0012\",\"options\":[{\"option\":[\"直接煮好\",\"煮好所有元宵\"]},{\"option\":[\"放任不管\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"偶遇林冲来店里吃元宵，他说着高太尉一伙对他的压迫，你决定\",\"label\":\"#0013\",\"options\":[{\"option\":[\"劝他反击\",\"元宝+30\"]},{\"option\":[\"做给他一碗元宵\",\"煮好3个元宵\"]}]}\n" +
        "{\"event\":\"武松要去打虎，路过你的店里吃元宵，他要牛肉味的元宵，你决定\",\"label\":\"#0014\",\"options\":[{\"option\":[\"给他做\",\"烟花+30\"]},{\"option\":[\"邦邦两拳\",\"元宵-3\"]}]}\n" +
        "{\"event\":\"你正在专心煮元宵，一个青眼赤须散发矮小的人想借你手中的扇子一用，你决定\",\"label\":\"#0015\",\"options\":[{\"option\":[\"不借，并喝口茶压压惊\",\"1个元宵成熟时间-30分钟\"]},{\"option\":[\"大方的借给他\",\"烟花+10\",\"营业额+1w\"]}]}\n" +
        "{\"event\":\"好友到你家里串门，他店里没人，你决定\",\"label\":\"#0016\",\"options\":[{\"option\":[\"好好招待他\",\"营业额+1w\"]},{\"option\":[\"去他店里逛一圈\",\"收益率+15%(或50%)\"]}]}\n" +
        "{\"event\":\"一个和尚来到店里化缘\",\"label\":\"#0017\",\"options\":[{\"option\":[\"邦邦两拳\",\"元宵-3\"]},{\"option\":[\"给了他一碗元宵\",\"元宝+30\"]}]}\n" +
        "{\"event\":\"女儿国女王要招你为婿，你决定\",\"label\":\"#0018\",\"options\":[{\"option\":[\"邦邦两拳\",\"元宵-3\"]},{\"option\":[\"接受了女王的爱意\",\"烟花+30\"]}]}\n" +
        "{\"event\":\"你放鞭炮惊动了年兽，要吃掉你的元宵，你决定\",\"label\":\"#0019\",\"options\":[{\"option\":[\"惧怕年兽，给她\",\"元宵-3\"]},{\"option\":[\"不惧年兽，不给它\",\"煮好所有元宵\"]}]}\n" +
        "{\"event\":\"\\\"“爱吃热狗的公子”问你输液了吗\\n（这是个很有钱的人）\\\"\",\"label\":\"#0020\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率-5%\"]},{\"option\":[\"上前询问\",\"1个元宵成熟时间+30分钟\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“嬉皮笑脸的人”想卖给你一些东西\\n（这是个奸商）\\\"\",\"label\":\"#0021\",\"options\":[{\"option\":[\"邦邦两拳\",\"无奖惩\"]},{\"option\":[\"上前询问\",\"“秘方大王”称号3天\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“长得像新英雄的坏女人”问你杀一下吗\\n（这是妺喜）\\\"\",\"label\":\"#0022\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率-5%\"]},{\"option\":[\"上前询问\",\"元宵-1&扇子+30\",\"元宵-3\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“躺在地上的人”瘦骨嶙峋毫无生气\\n（这是乞丐）\\\"\",\"label\":\"#0023\",\"options\":[{\"option\":[\"邦邦两拳\",\"元宵-1&收益率+5%\"]},{\"option\":[\"上前询问\",\"元宵-1&烟花+10\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“美丽的运营小妹儿”递给你一份攻略帖\\n（这是慕容）\\\"\",\"label\":\"#0024\",\"options\":[{\"option\":[\"邦邦两拳\",\"元宵-1\"]},{\"option\":[\"上前询问\",\"七彩元宵+1\",\"“秘方大王”称号3天\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“佛光普照的猴子”问你要不要去取经\\n（这是战斗力爆表的猴子）\\\"\",\"label\":\"#0025\",\"options\":[{\"option\":[\"邦邦两拳\",\"元宵-3\"]},{\"option\":[\"上前询问\",\"元宵-3\",\"收益率+5%(或15%)\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“佛光普照的人”问你要不要去取经\\n（这是圣僧）\\\"\",\"label\":\"#0026\",\"options\":[{\"option\":[\"邦邦两拳\",\"元宵-3\"]},{\"option\":[\"上前询问\",\"收益率+10%(或30%)\",\"无奖惩\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“在月宫伐桂的人”说我斧子很大，你忍一下\\n（这是北美产的电鳗）\\\"\",\"label\":\"#0027\",\"options\":[{\"option\":[\"邦邦两拳\",\"黄金元宵+1\"]},{\"option\":[\"上前询问\",\"元宵-1\",\"元宵-3&扇子+30\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“光头的人”问你今晚加班吗\\n（这是老板）\\\"\",\"label\":\"#0028\",\"options\":[{\"option\":[\"邦邦两拳\",\"1个元宵成熟时间+30分钟\"]},{\"option\":[\"上前询问\",\"1个元宵成熟时间+30分钟\",\"收益率-5%\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“看起来特别有钱的人”在店周围哈哈大笑\\n（这是富豪）\\\"\",\"label\":\"#0029\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率+10%(或30%)\"]},{\"option\":[\"上前询问\",\"“富豪”称号3天\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“带着拳套的人”看起来很善于格斗\\n（这是拳王）\\\"\",\"label\":\"#0030\",\"options\":[{\"option\":[\"邦邦两拳\",\"1个元宵成熟时间+30分钟\"]},{\"option\":[\"上前询问\",\"元宵-1&收益率+5%(或15%)\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“不穿上衣的人”身材魁梧面相凶狠\\n（这是壮汉）\\\"\",\"label\":\"#0031\",\"options\":[{\"option\":[\"邦邦两拳\",\"“壮汉”称号3天\"]},{\"option\":[\"上前询问\",\"煮好3个元宵\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“1966年出生的壮汉”问你要不要较量一下\\n（这是知名拳王）\\\"\",\"label\":\"#0032\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率-5%\"]},{\"option\":[\"上前询问\",\"收益率+10%(或30%)\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"一个霉气外漏的身影出现了\\n（这是霉神）\\\"\",\"label\":\"#0033\",\"options\":[{\"option\":[\"迎接霉神\",\"收益率-10%\"]},{\"option\":[\"一脚踢开\",\"营业额-5k\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“不速之客”面容姣好身材魁梧\\n（这是小偷）\\\"\",\"label\":\"#0034\",\"options\":[{\"option\":[\"邦邦两拳\",\"藏宝图+1\",\"无奖惩\"]},{\"option\":[\"上前询问\",\"无奖惩\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“身穿制服的人”伸手摸你的炉子\\n（这是城管）\\\"\",\"label\":\"#0035\",\"options\":[{\"option\":[\"邦邦两拳\",\"元宵-1\"]},{\"option\":[\"上前询问\",\"收益率+5%(或15%)\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“过于活泼的人”想钻进你的炉子\\n（这是熊孩子）\\\"\",\"label\":\"#0036\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率+5%(或15%)\"]},{\"option\":[\"上前询问\",\"“食神”称号3天\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“身高很矮的人”蹦蹦跳跳看着你的炉子\\n（这是小孩子）\\\"\",\"label\":\"#0037\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率-5%(或15%)\",\"元宵-1\"]},{\"option\":[\"上前询问\",\"煮好3个元宵\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“玩英雄杀十分厉害的人”想和你切磋一下\\n（这是另一个英雄杀玩家，选前两个都会转成石头剪刀布，赢平输三种结果随机）\\\"\",\"label\":\"#0038\",\"options\":[{\"option\":[\"邦邦两拳\",\"藏宝图+1（你赢）\",\"无奖惩（平手）\"]},{\"option\":[\"上前询问\",\"藏宝图+1（你赢）\",\"无奖惩（平手）\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"“穿裙子的男人”面容姣好身材苗条\",\"label\":\"#0039\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率-3%\"]},{\"option\":[\"上前询问\",\"无奖惩\",\"收益率+15%(或50%)\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"名家苏东坡请吃红豆元宵，你对元宵说\",\"label\":\"#0040\",\"options\":[{\"option\":[\"东坡爱豆的笑容都没你馅甜\",\"1个元宵成熟时间-30分钟\"]},{\"option\":[\"八月十五的月光都没你耀眼\",\"10分钟内收益率+50%\"]},{\"option\":[\"淡的跟白开水似的\",\"黄金元宵+1\"]}]}\n" +
        "{\"event\":\"流浪汉拿走一个元宵被你发现了\",\"label\":\"#0041\",\"options\":[{\"option\":[\"格局打开，元宵送给他了\",\"营业额-1w(或5w)\",\"换将卡+1\"]},{\"option\":[\"格局小了，拿棒槌抢元宵\",\"营业额+1k&收益率-10%\"]},{\"option\":[\"格局爆炸，送给他整炉元宵\",\"营业额-1w(或5w)\",\"藏宝图+3\",\"元宝+30\"]}]}\n" +
        "{\"event\":\"刘姓老者定10万个元宵要藏些纸条\",\"label\":\"#0042\",\"options\":[{\"option\":[\"打开纸条看看\",\"收益率+15%(或50%)\",\"无奖惩\"]},{\"option\":[\"拒绝订单\",\"无奖惩\"]},{\"option\":[\"接受订单\",\"营业额-1k\"]}]}\n" +
        "{\"event\":\"袁姓相士登门拿起元宵放在桌上\",\"label\":\"#0043\",\"options\":[{\"option\":[\"打开这个元宵一探究竟\",\"藏宝图+1\",\"无奖惩\"]},{\"option\":[\"吃下这个元宵\",\"无奖惩\"]},{\"option\":[\"将元宵赠予相士\",\"“秘方大王”称号3天\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"姓李的客人尝元宵忆童年，你安慰他说\",\"label\":\"#0044\",\"options\":[{\"option\":[\"都过去了，要向前看\",\"营业额+5w(或25w)\",\"无奖惩\"]},{\"option\":[\"一个10万，怎么支付\",\"换牌卡+1\",\"营业额-1w\"]},{\"option\":[\"啥玩意儿，想吃先付钱\",\"黄金元宵+1\",\"煮好所有元宵\"]}]}\n" +
        "{\"event\":\"扇风扇的太猛，吹断附近的网线\",\"label\":\"#0045\",\"options\":[{\"option\":[\"赔点钱\",\"收益率+5%(或15%)\"]},{\"option\":[\"给网线接上\",\"营业额-5k\"]},{\"option\":[\"继续扇风\",\"营业额-1k\"]}]}\n" +
        "{\"event\":\"手提鲜花的娇俏花仙子出现，你拍拍脸瞪大眼睛\",\"label\":\"#0046\",\"options\":[{\"option\":[\"原来是做梦\",\"1个元宵成熟时间-30分钟\"]},{\"option\":[\"居然是个梦\",\"营业额+1w(或5w)\"]},{\"option\":[\"可惜是个梦\",\"无奖惩\",\"藏宝图+1\"]}]}\n" +
        "{\"event\":\"对钱不感兴趣的人来借1个亿\",\"label\":\"#0047\",\"options\":[{\"option\":[\"借他1亿\",\"藏宝图+1\",\"营业额+1k(或5k)\"]},{\"option\":[\"借他20亿\",\"收益率+50%\",\"营业额-5w\"]},{\"option\":[\"不借他\",\"收益率-5%\"]}]}\n" +
        "{\"event\":\"巨大元宵冒着七彩光芒高速落向地面\",\"label\":\"#0048\",\"options\":[{\"option\":[\"用手接住\",\"收益率+8%(或25%)\",\"收益率-5%(或15%)\"]},{\"option\":[\"一拳打飞\",\"无奖惩\"]},{\"option\":[\"跑路\",\"收益率-5%\"]}]}\n" +
        "{\"event\":\"渔夫要3种不同口味的鱼儿专用元宵\",\"label\":\"#0049\",\"options\":[{\"option\":[\"不欢迎并赶出门去\",\"10分钟内收益率-50%\"]},{\"option\":[\"嘱咐ta注意安全\",\"收益率+10%(或30%)\"]},{\"option\":[\"只卖给他一种口味\",\"营业额+1k\"]}]}\n" +
        "{\"event\":\"你扇风扇太猛，越飞越高，只好\",\"label\":\"#0050\",\"options\":[{\"option\":[\"用扇子当降落伞\",\"1个元宵成熟时间-30分钟\"]},{\"option\":[\"用衣服当降落伞\",\"元宵-1\"]},{\"option\":[\"用睫毛当降落伞\",\"煮好3个元宵\"]}]}\n" +
        "{\"event\":\"好友元宵总煮失败，找大师你，你说：\",\"label\":\"#0051\",\"options\":[{\"option\":[\"不充钱你会变强吗\",\"收益率-5%(或15%)\",\"收益率+8%(或25%)\"]},{\"option\":[\"年轻人耗子尾汁，甭抢生意\",\"营业额-1k\"]},{\"option\":[\"我对钱没兴趣\",\"营业额-1k\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"元宵炉周围刮起台风，你决定\",\"label\":\"#0052\",\"options\":[{\"option\":[\"面对疾风吧\",\"收益率+5%\"]},{\"option\":[\"原地不动\",\"营业额-5k\",\"1个元宵成熟时间-30分钟\"]},{\"option\":[\"跑路\",\"元宵-1&营业额-5k\"]}]}\n" +
        "{\"event\":\"不觉七七四十九日，你见火候俱全，决定\",\"label\":\"#0053\",\"options\":[{\"option\":[\"开炉取元宵\",\"1个元宵成熟时间+30分钟\",\"1个元宵成熟时间-30分钟\"]},{\"option\":[\"再煮九九八十一日\",\"收益率-5%\"]},{\"option\":[\"在火中加入硫磷镁\",\"收益率-3%(或10%)\",\"营业额-1w\"]}]}\n" +
        "{\"event\":\"一辆车正在驶来，凑近看看发现\",\"label\":\"#0054\",\"options\":[{\"option\":[\"有一面包车人\",\"营业额+1w\"]},{\"option\":[\"有一车面包人\",\"收益率+8%(或25%)\"]},{\"option\":[\"有一面包车面包\",\"收益率-5%\"]}]}\n" +
        "{\"event\":\"门口有个衣衫褴褛的年轻女子大叫打滚要你给她一碗元宵，你\",\"label\":\"#0055\",\"options\":[{\"option\":[\"邦邦两拳、断然拒绝\",\"营业额+5w\"]},{\"option\":[\"欣然同意，给她一碗\",\"营业额-5k\"]},{\"option\":[\"置之不理，盛一碗对着她吃\",\"营业额-5k（文字描述上升5k，图标及实际-5k）\"]}]}\n" +
        "{\"event\":\"有一个猴子前来买元宵，说要香蕉味的元宵，你决定\",\"label\":\"#0056\",\"options\":[{\"option\":[\"邦邦两拳\",\"元宵-3\"]},{\"option\":[\"做给他吃\",\"扇子+30\"]},{\"option\":[\"直接无视\",\"元宵-3\"]}]}\n" +
        "{\"event\":\"店门口有个皮裤歌手在唱怒放的生命，你决定\",\"label\":\"#0057\",\"options\":[{\"option\":[\"问他穿皮裤放屁鼓包吗\",\"清空元宵\"]},{\"option\":[\"和他一起唱怒放的生命\",\"收益率-50%\",\"幸运币+1&收益率+100%\"]},{\"option\":[\"你静静看着\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"突然出现二个任意门，你决定\",\"label\":\"#0058\",\"options\":[{\"option\":[\"左边的门\",\"收益率+25%\"]},{\"option\":[\"右边的门\"]},{\"option\":[\"掉头就走\"]}]}\n" +
        "{\"event\":\"隔壁老奶奶正在剪窗花，欲要教你，你决定\",\"label\":\"#0059\",\"options\":[{\"option\":[\"一脸嫌弃的看着\",\"藏宝图+1\"]},{\"option\":[\"虚心请教\",\"10分钟内收益率+50%\"]},{\"option\":[\"坐下来细细学习\",\"清空元宵\"]}]}\n" +
        "{\"event\":\"正逢乱世，百姓苦不堪言，食不果腹，你决定\",\"label\":\"#0060\",\"options\":[{\"option\":[\"开设爱心元宵，免费赈灾\",\"藏宝图+1\"]},{\"option\":[\"熟视无睹，我行我素\",\"无奖惩\"]},{\"option\":[\"邦邦两拳\",\"清空元宵\"]}]}\n" +
        "{\"event\":\"分店老板以次充好，败坏你的品牌名声，你决定\",\"label\":\"#0061\",\"options\":[{\"option\":[\"把他店长的职位撤了\",\"无奖惩\"]},{\"option\":[\"以理服人\",\"换牌卡+1\"]},{\"option\":[\"邦邦两拳\",\"收益率-10%\"]}]}\n" +
        "{\"event\":\"小女孩向你推销五颜六色的汤圆，你看了看决定\",\"label\":\"#0062\",\"options\":[{\"option\":[\"告诉她我不喜欢甜食\",\"营业额-5k\"]},{\"option\":[\"询问一碗多少钱\",\"黄金元宵+1\"]},{\"option\":[\"不搭理\",\"营业额-5k\"]}]}\n" +
        "{\"event\":\"少年抱着可乐走进店里，要表演“龙吸水”，你决定\",\"label\":\"#0063\",\"options\":[{\"option\":[\"不欢迎并赶出门去\"]},{\"option\":[\"看他表演\",\"营业额+5k\"]},{\"option\":[\"我行我上\"]}]}\n" +
        "{\"event\":\"大家都拿出最好“行头”“剧本”，你决定\",\"label\":\"#0064\",\"options\":[{\"option\":[\"演上一出\"]},{\"option\":[\"给人捧场\",\"营业额+5k\"]},{\"option\":[\"偷师学艺\"]}]}\n" +
        "{\"event\":\"门外进来一名“乞丐”，如娇花照月，似弱柳扶风，向你讨要一碗元宵，你决定\",\"label\":\"#0065\",\"options\":[{\"option\":[\"给Ta一碗\",\"收益率+30%\"]},{\"option\":[\"邦邦两拳\"]},{\"option\":[\"置之不理\"]}]}\n" +
        "{\"event\":\"鹤发童颜的老者拿出三本秘籍，于是你选择\",\"label\":\"#0066\",\"options\":[{\"option\":[\"《一键仙人跪》\"]},{\"option\":[\"《天下第二》\"]},{\"option\":[\"《无敌发量神功》\",\"营业额+25w\"]}]}\n" +
        "{\"event\":\"你听闻煮元宵的时候有歌声相伴，元宵会更加好吃，于是你决定\",\"label\":\"#0067\",\"options\":[{\"option\":[\"请来粤语唱将：阿兰\",\"10分钟内收益率-50%\"]},{\"option\":[\"请来忧郁王子：友友\",\"清空元宵\"]},{\"option\":[\"请来搞笑歌手：洲霸天\",\"10分钟内收益率+50%\"]}]}\n" +
        "{\"event\":\"门外进来一名妹妹，双眸似水，带着淡淡的冰冷，向你要一碗元宵你决定\",\"label\":\"#0068\",\"options\":[{\"option\":[\"邦邦两拳果断拒绝\",\"营业额-5w\"]},{\"option\":[\"跟她cpdd\",\"收益率-30%\"]},{\"option\":[\"给她元宵\",\"幸运币+1\"]}]}\n" +
        "{\"event\":\"你突发奇想，在元宵馅中混入\",\"label\":\"#0069\",\"options\":[{\"option\":[\"芥末\",\"营业额-5k\"]},{\"option\":[\"奥利奥\",\"营业额+25w\"]},{\"option\":[\"牛肉\",\"营业额-5w\"]}]}\n" +
        "{\"event\":\"你正在家里煮元宵，突然听到了门外稀疏的脚步声，于是乎你决定\",\"label\":\"#0070\",\"options\":[{\"option\":[\"打开门看看\",\"1个元宵成熟时间+30分钟\"]},{\"option\":[\"打开了一个门缝看看\",\"收益率+15%(或50%)\"]},{\"option\":[\"充耳不闻，专心煮元宵\",\"1个元宵成熟时间-30分钟\"]}]}\n" +
        "{\"event\":\"朋友们喊你一起放爆竹，你看着他们手中的爆竹，你决定选择\",\"label\":\"#0071\",\"options\":[{\"option\":[\"冲天炮\",\"清空元宵\"]},{\"option\":[\"双响爆竹\",\"10分钟内收益率-50%\"]},{\"option\":[\"礼花\",\"营业额-5w\"]}]}\n" +
        "{\"event\":\"扇风扇的太猛，一个七彩的元宵被吹飞了\",\"label\":\"#0072\",\"options\":[{\"option\":[\"追上去\",\"收益率+15%(或50%)\"]},{\"option\":[\"继续扇\",\"无奖惩\"]},{\"option\":[\"用嘴接住\",\"营业额-5k\"]}]}\n" +
        "{\"event\":\"\\\"一个福气外漏的身影出现了\\n（这是福神）\\\"\",\"label\":\"#0073\",\"options\":[{\"option\":[\"迎接福神\",\"收益率+15%(或50%)\",\"扇子+50\"]},{\"option\":[\"一脚踢开\",\"收益率-10%\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"门外一位瘦骨嶙峋的长者三天没吃东西\",\"label\":\"#0074\",\"options\":[{\"option\":[\"给他一个元宵\",\"元宵+9\",\"收益率+10%(或30%)\"]},{\"option\":[\"把他赶出去\",\"收益率+5%\",\"10分钟内收益率-50%\"]},{\"option\":[\"收留他\",\"收益率+10%(或30%)\",\"10分钟内收益率-50%\"]}]}\n" +
        "{\"event\":\"\\\"“带着眼镜胖胖的人”问你要不要充钱\\n（这是策划）\\\"\",\"label\":\"#0075\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率+50%(或100%)\"]},{\"option\":[\"上前询问\",\"煮好所有元宵\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"你挤上前观看，杂耍团各种舞刀弄枪，胸口碎大石，着火的棍子呼呼呼转的停不下来，你决定\",\"label\":\"#0076\",\"options\":[{\"option\":[\"表演不错，打赏\",\"元宝+30\"]},{\"option\":[\"技术这么差还想要钱\"]},{\"option\":[\"技术太差没眼看\"]}]}\n" +
        "{\"event\":\"你突发奇想从太上老君那里借来三昧真火煮元宵，结果元宵锅极速震动，你决定\",\"label\":\"#0077\",\"options\":[{\"option\":[\"火力加大\",\"七彩元宵+1\"]},{\"option\":[\"撤掉三昧真火\",\"无奖惩\"]},{\"option\":[\"熟视无睹\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"他进来看到你孤身一人在房间里，便手持一把刀向你冲了过来，并大喊一声：杀！这时你决定\",\"label\":\"#0078\",\"options\":[{\"option\":[\"出一张闪\",\"元宝+30\"]},{\"option\":[\"夺门而逃\",\"清空元宵\"]},{\"option\":[\"跟他拼了\",\"清空元宵\"]}]}\n" +
        "{\"event\":\"他说自己已经三天没吃东西了，向你化一点吃食，你决定\",\"label\":\"#0079\",\"options\":[{\"option\":[\"给他一碗元宵\",\"煮好所有元宵\"]},{\"option\":[\"给他做一顿饭\"]},{\"option\":[\"把他赶走\"]}]}\n" +
        "{\"event\":\"你正在家里煮元宵，班主任陆老师到访并要检查你的作业，但你没写，你只好\",\"label\":\"#0080\",\"options\":[{\"option\":[\"请陆老师吃元宵\",\"元宝+30\"]},{\"option\":[\"带陆老师玩英雄杀\",\"清空元宵&黄金元宵+1\"]},{\"option\":[\"赶紧写作业\",\"收益率+30%\"]}]}\n" +
        "{\"event\":\"\\\"“看起来很会画画的人”问要不要去英雄茶馆\\n（这是茶馆刘师傅）\\\"\",\"label\":\"#0081\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率-15%\"]},{\"option\":[\"上前询问\",\"七彩元宵+1\",\"黄金元宵+1\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“文质彬彬”的人风度翩翩意气风发\\n（这是诗人）\\\"\",\"label\":\"#0082\",\"options\":[{\"option\":[\"邦邦两拳\",\"藏宝图+1\"]},{\"option\":[\"上前询问\",\"七彩元宵+1\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“穿洛丽塔的人”问你要不要一起逛街\\n（这是个美少女）\\\"\",\"label\":\"#0083\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率-5%\"]},{\"option\":[\"上前询问\",\"收益率+15%(或50%)\",\"七彩元宵+1\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“拿着袋子的人”在你炉子边等待\\n（这是正常顾客）\\\"\",\"label\":\"#0084\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率-5%\"]},{\"option\":[\"上前询问\",\"藏宝图+1\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“挥动锤子的人”手里有烧红的武器\\n（这是铁匠）\\\"\",\"label\":\"#0085\",\"options\":[{\"option\":[\"邦邦两拳\",\"元宵-1\"]},{\"option\":[\"上前询问\",\"扇子+30\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“顶着黄金厨师帽的人”霸气外露\\n（这是食神）\\\"\",\"label\":\"#0086\",\"options\":[{\"option\":[\"邦邦两拳\",\"“食神”称号3天\"]},{\"option\":[\"上前询问\",\"七彩元宵+1\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“穿吉利服的人”问你吃鸡吗\\n（这是老兵）\\\"\",\"label\":\"#0087\",\"options\":[{\"option\":[\"邦邦两拳\",\"无奖惩\"]},{\"option\":[\"上前询问\",\"营业额+1w(或5w或10w或25w)\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“背着键盘的人”在你炉子边指指点点\\n（这是键盘侠）\\\"\",\"label\":\"#0088\",\"options\":[{\"option\":[\"邦邦两拳\",\"收益率+5%(或15%)\"]},{\"option\":[\"上前询问\",\"煮好所有元宵\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"\\\"“身穿运动服的人”意气风发身手矫健\\n（这是运动员）\\\"\",\"label\":\"#0089\",\"options\":[{\"option\":[\"邦邦两拳\",\"元宵-1\"]},{\"option\":[\"上前询问\",\"元宵-1&黄金元宵+1\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"你的团扇绽放闪耀的金光\",\"label\":\"#0090\",\"options\":[{\"option\":[\"把扇子扔掉\",\"收益率-5%\"]},{\"option\":[\"大喊变身\",\"收益率+15%(或50%)\",\"营业额+5w(或25w)\"]},{\"option\":[\"打扇子一拳\",\"收益率-5%\"]}]}\n" +
        "{\"event\":\"尝了一口发现元宵不好吃，你决定\",\"label\":\"#0091\",\"options\":[{\"option\":[\"换个食材供应商\",\"10分钟内收益率+50%\",\"营业额-5w\"]},{\"option\":[\"点个元宵外卖\",\"营业额+5w(或25w)\",\"收益率+15%(或50%)\"]},{\"option\":[\"卧薪尝胆\",\"营业额-1w\"]}]}\n" +
        "{\"event\":\"看到烧香拜佛者居多，你决定\",\"label\":\"#0092\",\"options\":[{\"option\":[\"有样学样\"]},{\"option\":[\"摆摊赚钱\",\"收益率+100%\"]},{\"option\":[\"看热闹\"]}]}\n" +
        "{\"event\":\"真假美猴王让你帮忙分辨，你决定\",\"label\":\"#0093\",\"options\":[{\"option\":[\"让他们去他处，自己不行\",\"无奖惩\"]},{\"option\":[\"请他们吃一碗元宵\",\"煮好所有元宵\"]},{\"option\":[\"直接无视\",\"元宵-3\"]}]}\n" +
        "{\"event\":\"你在过流沙河时遇到了危险，即将被沙僧所吃，你决定\",\"label\":\"#0094\",\"options\":[{\"option\":[\"邦邦两拳\"]},{\"option\":[\"立马做给他一碗元宵\",\"扇子+50\"]},{\"option\":[\"偷偷溜走\"]}]}\n" +
        "{\"event\":\"穿越到元宵世界，这时汤圆精灵看了过来，你决定\",\"label\":\"#0095\",\"options\":[{\"option\":[\"撒腿就跑\"]},{\"option\":[\"站着不动\",\"元宵+9\"]},{\"option\":[\"上去抓住\"]}]}\n" +
        "{\"event\":\"你的摊子前面来了一头猪，自称天蓬转世，要给你打工，要你管饭，你决定\",\"label\":\"#0096\",\"options\":[{\"option\":[\"答应他\",\"元宵-3\"]},{\"option\":[\"邦邦两拳\",\"烟花+30\"]},{\"option\":[\"直接无视\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"冷风吹进来，室内温度都低了很多，你想着得把窗户补好，你决定\",\"label\":\"#0097\",\"options\":[{\"option\":[\"拿纸糊起来\",\"收益率+15%\"]},{\"option\":[\"去买新玻璃\",\"元宝+30\"]},{\"option\":[\"放任不管\",\"1个元宵成熟时间+30分钟\"]}]}\n" +
        "{\"event\":\"秦琼想要卖马给你换取盘缠，你决定\",\"label\":\"#0098\",\"options\":[{\"option\":[\"买了马\"]},{\"option\":[\"没买马，但是赠与他盘缠\",\"收益率+100%\"]},{\"option\":[\"邦邦两拳\"]}]}\n" +
        "{\"event\":\"有一个叫“年”的怪兽来临，于是你放起鞭炮，“年”吓得望风而逃，你决定\",\"label\":\"#0099\",\"options\":[{\"option\":[\"妖魔鬼怪莫进身\"]},{\"option\":[\"开门爆竹\",\"烟花+30\"]},{\"option\":[\"安全隐患需注意\",\"营业额-5k\"]}]}\n" +
        "{\"event\":\"外面寒风凛冽，你看见断臂男子站在门外，身旁站着一只雕，你决定\",\"label\":\"#0100\",\"options\":[{\"option\":[\"开门迎客\",\"收益率+10%\"]},{\"option\":[\"不理不睬\",\"七彩元宵+1\"]},{\"option\":[\"让他滚蛋\"]}]}\n" +
        "{\"event\":\"扇风扇的太猛给扇子扇坏了\",\"label\":\"#0101\",\"options\":[{\"option\":[\"用手扇风\",\"1个元宵成熟时间-30分钟\"]},{\"option\":[\"用脚扇风\",\"“扇风侠”称号3天\"]},{\"option\":[\"用舌头扇风\",\"幸运币+1\"]}]}\n" +
        "{\"event\":\"煮炉中出现了一颗危险的手捧雷\",\"label\":\"#0102\",\"options\":[{\"option\":[\"大力扇风\",\"黄金元宵+1\"]},{\"option\":[\"扔掉它\",\"1个元宵成熟时间+30分钟\"]},{\"option\":[\"吃掉它\",\"收益率+15%(或50%)\"]}]}\n" +
        "{\"event\":\"你颤颤巍巍划着了一根火柴，看到\",\"label\":\"#0103\",\"options\":[{\"option\":[\"一盘煮鸭\",\"无奖惩\",\"营业额+5k\"]},{\"option\":[\"慈祥的老奶奶\",\"营业额+1w\"]},{\"option\":[\"英雄杀小程序\",\"营业额+5w(或25w)\"]}]}\n" +
        "{\"event\":\"你团扇被火烤坏了，看门口芭蕉心生一计\",\"label\":\"#0104\",\"options\":[{\"option\":[\"用芭蕉叶子做扇\",\"收益率+10%\",\"营业额-5k\"]},{\"option\":[\"用芭蕉做扇\",\"10分钟内收益率+50%\"]},{\"option\":[\"倒拔芭蕉树开始扇风\",\"烟花+10\",\"营业额+5k(或25k)\"]}]}\n" +
        "{\"event\":\"对面好友元宵店生意火爆，决定去偷吃元宵\",\"label\":\"#0105\",\"options\":[{\"option\":[\"捂住自己的眼睛偷吃\",\"营业额-1w\"]},{\"option\":[\"捂住好友的眼睛偷吃\",\"七彩元宵+1\",\"营业额-5k\"]},{\"option\":[\"捂住元宵的眼睛偷吃\",\"烟花+30\",\"扇子+30\"]}]}\n" +
        "{\"event\":\"这里是元宵迷宫，迷宫的墙壁都是汤圆做的，走出可获奖励，你决定\",\"label\":\"#0106\",\"options\":[{\"option\":[\"上前问路\"]},{\"option\":[\"另寻出口\"]},{\"option\":[\"信你个鬼\",\"七彩元宵+1\"]}]}\n" +
        "{\"event\":\"元宵节当天在厨房初遇年兽在偷吃，你决定\",\"label\":\"#0107\",\"options\":[{\"option\":[\"拿起棒棍驱赶它\"]},{\"option\":[\"当做没看到，落荒而逃\"]},{\"option\":[\"安抚并拿出元宵与其分享\",\"七彩元宵+1\"]}]}\n" +
        "{\"event\":\"开分店需要资金，你准备找唐僧，你决定\",\"label\":\"#0108\",\"options\":[{\"option\":[\"银行\"]},{\"option\":[\"网上贷款\"]},{\"option\":[\"买彩票\",\"七彩元宵+1\"]}]}\n" +
        "{\"event\":\"秦琼卖给你的马被时迁偷了，你决定\",\"label\":\"#0109\",\"options\":[{\"option\":[\"夺回马\",\"换将卡+1\"]},{\"option\":[\"打他一顿让他知道你不好惹\",\"元宵-3\"]},{\"option\":[\"以德报怨，劝他向善\",\"元宝+30\"]}]}\n" +
        "{\"event\":\"一个自称是勾黛大师的人，来到你的店铺前，问你要不要拜师和她一起去练武，你决定\",\"label\":\"#0110\",\"options\":[{\"option\":[\"邦邦两拳\"]},{\"option\":[\"拜她为师\"]},{\"option\":[\"给她一个汤圆\",\"元宵+9\"]}]}\n" +
        "{\"event\":\"\\\"“骑电动车的人”问你这瓜保熟吗\\n（这是华强刘）\\\"\",\"label\":\"#0111\",\"options\":[{\"option\":[\"邦邦两拳\",\"七彩元宵+1\"]},{\"option\":[\"上前询问\",\"藏宝图+1\",\"收益率+15%\"]},{\"option\":[\"偷偷观察\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"数把神兵从天而降，你选择\",\"label\":\"#0112\",\"options\":[{\"option\":[\"宣花斧\",\"营业额+5w(或25w)\"]},{\"option\":[\"龙鳞刀\",\"煮好所有元宵\"]},{\"option\":[\"芦叶枪\",\"1个元宵成熟时间-30分钟\"]}]}\n" +
        "{\"event\":\"八戒为祸高老庄，庄主苦不堪言，你决定\",\"label\":\"#0113\",\"options\":[{\"option\":[\"请大圣来帮忙\",\"元宝+30\"]},{\"option\":[\"给八戒吃元宵，劝他不作乱\",\"收益率+50%\"]},{\"option\":[\"直接无视\",\"收益率-50%\"]}]}\n" +
        "{\"event\":\"你的炉子角落长出来一些“红伞伞”\",\"label\":\"#0114\",\"options\":[{\"option\":[\"吃掉红伞伞\",\"烟花+30\"]},{\"option\":[\"拿起红伞伞\",\"无奖惩\"]},{\"option\":[\"喂红伞伞吃元宵\",\"扇子+50\"]}]}\n" +
        "{\"event\":\"一个穿着黑色风衣的陌生人出现，拉低帽子用神秘的语气对你说：天王盖地虎！你想了想，回道：\",\"label\":\"#0115\",\"options\":[{\"option\":[\"宝塔镇河妖！\",\"元宵+9\"]},{\"option\":[\"天冷被里捂\"]},{\"option\":[\"CPDD\",\"煮好所有元宵\"]}]}\n" +
        "{\"event\":\"十大堂齐聚一堂，有说有笑，正有人提议玩一局英雄杀时，年兽冒出来欲要与你们一决高下\",\"label\":\"#0116\",\"options\":[{\"option\":[\"掏出手机来一局\",\"煮好所有元宵\"]},{\"option\":[\"拒绝并把年兽揍出去\",\"无奖惩\"]},{\"option\":[\"手机没电了\",\"扇子+50\"]}]}\n" +
        "{\"event\":\"他说隔老远就闻到你家里的元宵香味了，要出钱买走你所有的元宵，你决定\",\"label\":\"#0117\",\"options\":[{\"option\":[\"卖给他\",\"元宝+30&清空元宵\"]},{\"option\":[\"打死不卖\",\"收益率-8%\"]},{\"option\":[\"送他一炉\",\"元宵-3&七彩元宵+1\"]}]}\n" +
        "{\"event\":\"当上英雄杀策划的你激动不已，决定大笔一挥给玩家发福利，你想了想决定给每个人发\",\"label\":\"#0118\",\"options\":[{\"option\":[\"换牌卡\",\"换牌卡+1\"]},{\"option\":[\"元宝\",\"元宝+30\"]},{\"option\":[\"扇子\",\"扇子+50\"]}]}\n" +
        "{\"event\":\"你打开门发现来人是多日未见的徒弟，他一边祝你节日快乐一边问师父你什么时候带我玩啊，你回答道\",\"label\":\"#0119\",\"options\":[{\"option\":[\"带个锤子带我自己都打不过\",\"煮好所有元宵\"]},{\"option\":[\"上号\",\"扇子+50\"]},{\"option\":[\"你来看为师也不带点礼物？\",\"元宝+30\"]}]}\n" +
        "{\"event\":\"你正煮着汤圆，村里舞龙灯巡游街道，于是乎你迎上前去，这时你选择摸龙灯的哪个部位？\",\"label\":\"#0120\",\"options\":[{\"option\":[\"龙灯\",\"七彩元宵+1\"]},{\"option\":[\"龙衣\"]},{\"option\":[\"全部都摸一下\",\"煮好所有元宵\"]}]}\n" +
        "{\"event\":\"不是说建国后不许成精？你带着这个疑问追了上去，那个元宵递上礼盒向你讨饶，你\",\"label\":\"#0121\",\"options\":[{\"option\":[\"收下礼盒放他逃生\",\"藏宝图+3\"]},{\"option\":[\"快到碗里来\",\"收益率-10%\"]},{\"option\":[\"拉它回来帮你卖元宵\"]}]}\n" +
        "{\"event\":\"你连人带店一起被漩涡吞噬，在你的面前有三个选择\",\"label\":\"#0122\",\"options\":[{\"option\":[\"海域古道\",\"营业额+5w\"]},{\"option\":[\"丛林秘境\",\"七彩元宵+1\"]},{\"option\":[\"英雄杀空间\",\"营业额+5k\"]}]}\n" +
        "{\"event\":\"门外人来人往非常热闹，一阵宛转悠扬的歌声传来吸引了你，你仔细的听了下发现歌词的内容是\",\"label\":\"#0123\",\"options\":[{\"option\":[\"女驸马\",\"扇子+50\"]},{\"option\":[\"天仙配\"]},{\"option\":[\"牛郎织女\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"有一位陌生男子敲门，此男子光着头并自称是游戏策划，你决定\",\"label\":\"#0124\",\"options\":[{\"option\":[\"请他进来做客\",\"七彩元宵+1\"]},{\"option\":[\"疯狂嘲笑他\",\"元宵-3\"]},{\"option\":[\"打发他走\",\"-30%\"]}]}\n" +
        "{\"event\":\"店门口出现一个醉汉，他问你小元宵送个碗，一块钱四个卖不卖，并坐下想跟你喝一杯，你决定\",\"label\":\"#0125\",\"options\":[{\"option\":[\"今晚与他不醉不归\",\"煮好所有元宵\"]},{\"option\":[\"告诉他碗是另外的价钱\"]},{\"option\":[\"不卖并邦邦给他两拳\"]}]}\n" +
        "{\"event\":\"一个玉树临风的男子来到了店里，他手里端着两碗七彩元宵邀你一起吃，跟你说早点下班，不要浪费公司水电了\",\"label\":\"#0126\",\"options\":[{\"option\":[\"你一把打翻元宵\",\"煮好所有元宵\"]},{\"option\":[\"放下手中的活说好嘞我来啦\"]},{\"option\":[\"你努力的搓着元宵并不理他\"]}]}\n" +
        "{\"event\":\"你看到各地汤圆都各不相同，你准备把汤圆加工成其他汤圆，你决定加工成\",\"label\":\"#0127\",\"options\":[{\"option\":[\"苏州五色汤圆\",\"七彩元宵+1\"]},{\"option\":[\"上海擂沙汤圆\"]},{\"option\":[\"宁波汤圆\"]}]}\n" +
        "{\"event\":\"你正在卧室床上玩着英雄杀，看到你同桌给你打了一个电话，你决定\",\"label\":\"#0128\",\"options\":[{\"option\":[\"和妹子语音打游戏，挂掉\",\"元宝+30\"]},{\"option\":[\"你接听了电话并且答应赴约\"]},{\"option\":[\"你果断拒绝了同学的邀请\"]}]}\n" +
        "{\"event\":\"你正在家中吃着元宵，忽然有敲门声，你打开门迎入一位英俊的男子，相谈甚欢。临走前你问男子姓氏，男子念诗后消失。\",\"label\":\"#0129\",\"options\":[{\"option\":[\"李白\",\"元宵-3\"]},{\"option\":[\"柳宗元\",\"收益率-10%\"]},{\"option\":[\"王安石\",\"七彩元宵+1\"]}]}\n" +
        "{\"event\":\"本来你的生意兴隆,可是突然有人在你家对面开了一家元宵店,而且口味丰富,把你的生意抢了不少,你决定\",\"label\":\"#0130\",\"options\":[{\"option\":[\"偷偷打店主一顿\"]},{\"option\":[\"你决定派个间谍去偷师学艺\"]},{\"option\":[\"钻研做元宵的创意和做法\",\"七彩元宵+1,收益率+100%\"]}]}\n" +
        "{\"event\":\"本你去你朋友家闹元宵,发现了他锅里的元宵,于是乎你迎上前去,决定\",\"label\":\"#0131\",\"options\":[{\"option\":[\"果断出手拿走一个元宵\"]},{\"option\":[\"你给锅里的元宵加了点芝麻\",\"七彩元宵+1\"]},{\"option\":[\"你往锅里放了点红糖\"]}]}\n" +
        "{\"event\":\"见客入来，袜刬金钗溜，和羞走，倚门回首，却把元宵嗅，你与客人一见钟情决定\",\"label\":\"#0132\",\"options\":[{\"option\":[\"掰开元宵一人一半当信物\",\"黄金元宵+1\",\"无奖惩\"]},{\"option\":[\"约ta一起双排英雄杀\",\"收益率-5%\"]},{\"option\":[\"掰开炉子一人一半当信物\",\"无奖惩\"]},{\"option\":[\"分一半资产当做信物\",\"营业额-1w(或5w)\"]}]}\n" +
        "{\"event\":\"“满逸派”旅者说端午安康请你吃粽子\",\"label\":\"#0133\",\"options\":[{\"option\":[\"元宵节快乐\",\"营业额+1k\"]},{\"option\":[\"劳动节快乐\",\"收益率+5%(或15%)\"]},{\"option\":[\"端午节安康\",\"营业额-5k\"]},{\"option\":[\"情人节快乐\",\"收益率-5%\"]}]}\n" +
        "{\"event\":\"落魄诗人用珍藏墨宝换元宵\",\"label\":\"#0134\",\"options\":[{\"option\":[\"收下墨宝，元宵店送ta\",\"收益率+5%\"]},{\"option\":[\"大喊“我发财啦”\",\"元宵-3\"]},{\"option\":[\"一脸正气拒绝并送一个元宵\",\"收益率+10%(或30%)\"]},{\"option\":[\"烧了墨宝煮元宵\",\"营业额-5k\"]}]}\n" +
        "{\"event\":\"煮好了7个元宵，你决定\",\"label\":\"#0135\",\"options\":[{\"option\":[\"教元宵喊爷爷\",\"10分钟内收益率-50%\"]},{\"option\":[\"提防一下贪吃的蛇蝎\",\"营业额-1w\"]},{\"option\":[\"把元宵拿来炼丹\",\"烟花+10\",\"煮好3个元宵\"]},{\"option\":[\"寻找第六个元宵\",\"营业额-1w\",\"黄金元宵+1\"]}]}\n" +
        "{\"event\":\"身材窈窕的貌美女子说没有奶茶元宵会倒闭，你决定\",\"label\":\"#0136\",\"options\":[{\"option\":[\"立刻增加奶茶元宵\",\"营业额+1w\"]},{\"option\":[\"抢过她的奶茶喝一口\",\"营业额-5k\"]},{\"option\":[\"目不转睛盯着她看\",\"收益率+10%(或30%)\"]},{\"option\":[\"把她赶出门去\",\"元宵-3&收益率-5%\"]}]}\n" +
        "{\"event\":\"一个美丽的女子到了你的店里，她说你在几百年前救了她，她要以身相许，你决定\",\"label\":\"#0137\",\"options\":[{\"option\":[\"你答应了她\",\"收益率-15%\",\"烟花+10\"]},{\"option\":[\"你拒绝了\",\"无奖惩\"]},{\"option\":[\"邦邦两拳\",\"元宵-3\"]},{\"option\":[\"直接无视\",\"无奖惩\"]}]}\n" +
        "{\"event\":\"除夕夜，“祟”出来害人，你来势汹汹跑到“祟”前面\",\"label\":\"#0138\",\"options\":[{\"option\":[\"用压岁钱砸它\",\"营业额+5w\"]},{\"option\":[\"挥动你的桃木剑\",\"10分钟内收益率+50%\"]},{\"option\":[\"请它吃汤圆\",\"元宵-3\"]},{\"option\":[\"好心劝说\",\"10分钟内收益率-50%\"]}]}\n" +
        "{\"event\":\"你正在家里客厅陪外婆聊天，这时七大姑八大姨来家里做客，你决定\",\"label\":\"#0139\",\"options\":[{\"option\":[\"默默的去搬了一个小板凳\"]},{\"option\":[\"给同学发微信叫她打电话来\"]},{\"option\":[\"去卧室，打开英雄杀\",\"无奖惩\"]},{\"option\":[\"两耳不闻周边事儿\"]}]}\n" +
        "{\"event\":\"一个衣着光鲜的人走了进来，他说有人去官府告你不当竞争，他可以帮你，你决定\",\"label\":\"#0140\",\"options\":[{\"option\":[\"以礼相待接受勒索\",\"营业额+25w\"]},{\"option\":[\"邦邦两拳轰他出门\",\"收益率-50%\"]},{\"option\":[\"挑衅他，并喊“不服打我”\"]},{\"option\":[\"控制住这个人，喂他吃元宵\",\"清空元宵\"]}]}\n" +
        "{\"event\":\"几个朋友发现在直播打游戏的你很厉害，于是跑来找你带他们上分，于是你决定\",\"label\":\"#0141\",\"options\":[{\"option\":[\"一个一个带他们打赛事\",\"10分钟内收益率+50%\"]},{\"option\":[\"喊他们一起去打身份场\",\"营业额-5k\"]},{\"option\":[\"带他们玩初级场\",\"营业额-25k\"]},{\"option\":[\"带他们去世界频道cpdd\",\"清空元宵\"]}]}\n" +
        "{\"event\":\"一名衣衫褴褛的流浪汉唱着歌走了进来，他道他祖上擅岐黄之道，现有一本医学秘方有助于日常眼部护理、提升视力\",\"label\":\"#0142\",\"options\":[{\"option\":[\"给他邦邦两拳\",\"营业额-5k\"]},{\"option\":[\"用自己的歌声交换秘方\",\"无事\"]},{\"option\":[\"欣然点头，同意交换\",\"收益率+50%\"]},{\"option\":[\"断然拒绝并用言语羞辱他\"]}]}\n" +
        "{\"event\":\"一个中年老男人来店里，说自己姓顾，是历史文学爱好者，可以给大家讲历史故事促进你店里的客流量\",\"label\":\"#0143\",\"options\":[{\"option\":[\"你接受了他的提议\",\"收益率+100%\",\"收益率-50%（描述写的-100%，下方图标及实际-50%）\"]},{\"option\":[\"你拒绝了他的提议\",\"10分钟内收益率-50%\"]},{\"option\":[\"你直接无视他了\",\"元宵-1\"]},{\"option\":[\"邦邦两拳\",\"收益率-25%\"]}]}\n" +
        "{\"event\":\"你在和朋友聊天，陈圆圆让你们比一下谁做的汤圆更好吃，你决定\",\"label\":\"#0144\",\"options\":[{\"option\":[\"把陈圆圆赶出去\",\"10分钟内收益率-50%\"]},{\"option\":[\"大展身手把朋友比过去\",\"七彩元宵+1\"]},{\"option\":[\"输给朋友\",\"10分钟内收益率+50%（描述写的下降50%，下方图标及实际+50%）\"]},{\"option\":[\"扭头就走\"]}]}\n" +
        "{\"event\":\"顾客说元宵口味太少了，你最终决定开发\",\"label\":\"#0145\",\"options\":[{\"option\":[\"芥末馅元宵\",\"清空元宵\"]},{\"option\":[\"榴莲馅元宵\",\"收益率+50%\"]},{\"option\":[\"元宵馅元宵\",\"收益率+5%\"]},{\"option\":[\"空气馅元宵\",\"清空元宵\"]}]}\n" +
        "{\"event\":\"长腿美人在做“头号店铺”的采访，希望采访你，你决定\",\"label\":\"#0146\",\"options\":[{\"option\":[\"拒绝访谈\"]},{\"option\":[\"接受访谈\",\"煮好所有元宵\"]},{\"option\":[\"邀请她一起玩英雄杀\"]},{\"option\":[\"cpdd\"]}]}\n" +
        "{\"event\":\"门口出现一个梳着单马尾的JK少女，手捧一大杯奶茶，你忽然心动，于是你决定\",\"label\":\"#0147\",\"options\":[{\"option\":[\"向她表白\"]},{\"option\":[\"一把抱住\",\"煮好所有元宵\"]},{\"option\":[\"一把抢过她的奶茶\"]},{\"option\":[\"邀请她一起玩英雄杀\"]}]}\n" +
        "{\"event\":\"遇到一名王姓歌手，在你门前唱歌，歌名是需要人陪，你决定\",\"label\":\"#0148\",\"options\":[{\"option\":[\"打他一顿\"]},{\"option\":[\"直接赶走他\"]},{\"option\":[\"请他吃碗元宵\"]},{\"option\":[\"扔他臭鸡蛋\",\"扇子+50\"]}]}\n" +
        "{\"event\":\"有个看起来高深莫测的老者到店门口说要卖给你制作七彩元宵的秘籍\",\"label\":\"#0149\",\"options\":[{\"option\":[\"你直接赶走老者\",\"10分钟内收益率-50%\"]},{\"option\":[\"邦邦两拳\",\"10分钟内收益率-50%\"]},{\"option\":[\"请他吃元宵并不再搭理他\",\"黄金元宵+1\"]},{\"option\":[\"重金买下了秘籍\",\"七彩元宵+1\",\"收益率-50%\"]}]}\n" +
        "{\"event\":\"你推开窗户，原来是挚友邀请你出去一起欢庆佳节，你匆匆穿好衣服出门并决定参与\",\"label\":\"#0150\",\"options\":[{\"option\":[\"猜灯谜\",\"幸运币+1\"]},{\"option\":[\"耍龙灯\"]},{\"option\":[\"踩高跷\"]},{\"option\":[\"舞狮子\",\"元宝+30\"]}]}\n" +
        "{\"event\":\"你无意间听到隔壁店铺的伙计说他们老板为了招揽顾客要雇人表演踩高跷，于是你决定\",\"label\":\"#0151\",\"options\":[{\"option\":[\"先他一步雇人表演\",\"幸运币+1\"]},{\"option\":[\"经费不足，自己上场表演\"]},{\"option\":[\"找来更钟意的舞狮子表演\"]},{\"option\":[\"当作无事发生\",\"煮好所有元宵\"]}]}\n" +
        "{\"event\":\"你上前与老师问好，老师抬头便问：“到了长城放声唱，这唱的到底是个什么歌曲？”\",\"label\":\"#0152\",\"options\":[{\"option\":[\"《北京欢迎你》\"]},{\"option\":[\"《好汉歌》\",\"煮好所有元宵\"]},{\"option\":[\"《长城》\"]},{\"option\":[\"《精忠报国》\"]}]}\n" +
        "{\"event\":\"你将放久坏掉的汤圆倒入桶中，突然出现一个桶神，问哪个是你的汤圆，你看了看\",\"label\":\"#0153\",\"options\":[{\"option\":[\"五彩汤圆\"]},{\"option\":[\"金汤圆\"]},{\"option\":[\"银汤圆\"]},{\"option\":[\"正常的汤圆\",\"元宵+9\"]}]}\n" +
        "{\"event\":\"他说自己做生意赔了，找你借200块东山再起，等赚了钱还你200万，你决定\",\"label\":\"#0154\",\"options\":[{\"option\":[\"借钱给他\",\"收益率-25%\"]},{\"option\":[\"报警\",\"黄金元宵+1\"]},{\"option\":[\"邦邦两拳\",\"元宝+30\"]},{\"option\":[\"把他赶走\",\"煮好3个元宵\"]}]}\n" +
        "{\"event\":\"年终岁尾了，你在自己家门口贴着春联欢迎英雄杀的小伙伴，你决定\",\"label\":\"#0155\",\"options\":[{\"option\":[\"游戏滴滴\",\"烟花+30\"]},{\"option\":[\"贴春联\"]},{\"option\":[\"CP滴滴\"]},{\"option\":[\"当窗理云鬓，对镜贴花黄\"]}]}\n" +
        "{\"event\":\"你正在煮着汤圆，闲来无事打开手机，看到了几个热搜，你心里想先看哪一个呢？\",\"label\":\"#0156\",\"options\":[{\"option\":[\"某直播一姐卖元宵没交税\"]},{\"option\":[\"某男明星婚内出轨\"]},{\"option\":[\"某地出现新逃犯\"]},{\"option\":[\"茶馆上榜第一小程序社区\",\"煮好所有元宵\"]}]}\n" +
        "{\"event\":\"你的手放在了他的元宵上，你决定\",\"label\":\"#0157\",\"options\":[{\"option\":[\"拿来吧你\"]},{\"option\":[]},{\"option\":[]},{\"option\":[]},{\"option\":[]},{\"option\":[]},{\"option\":[\"把手拿开\",\"扇子+10（好友显示：被人守护了）\",\"无奖惩（好友显示：被人守护了）\"]}]}\n" +
        "{\"event\":\"主人掰了一块元宵给你，你\",\"label\":\"#0158\",\"options\":[{\"option\":[\"说道：嫂嫂不会生气吧\"]},{\"option\":[\"换牌卡+1（好友显示：被人守护了）\"]},{\"option\":[\"重新拿了一整块\",\"营业额-5k(或25k)（好友显示：被人守护了）\"]},{\"option\":[\"双手接过\",\"元宵+1（好友显示：被人守护了）\",\"黄金元宵+1（好友显示：被人守护了）\"]}]}\n" +
        "{\"event\":\"旁人故意高声嚷：你一定又来偷元宵了。你\",\"label\":\"#0159\",\"options\":[{\"option\":[\"说道：读书人的事能算偷么\",\"黄金元宵+1（好友显示：被人守护了）\",\"无奖惩（好友显示：哈哈哈)\"]},{\"option\":[\"就刻板印象即兴演讲\",\"元宵+1（好友显示：被偷了）\",\"藏宝图+1（好友显示：呜呜呜）\"]},{\"option\":[\"当即拿了一个元宵\",\"七彩元宵+1（好友显示：被偷了）\",\"无奖惩（好友显示：哈哈哈）\"]}]}\n" +
        "{\"event\":\"他煮的不是元宵，居然是一堆粽子\",\"label\":\"#0160\",\"options\":[{\"option\":[\"去划龙舟\",\"扇子+10（好友显示：被人守护了）\"]},{\"option\":[\"吃掉粽子\",\"“食神”称号3天（好友显示：被人守护了）\"]},{\"option\":[\"给粽子拿走\",\"营业额+1k（好友显示：被人守护了）\"]}]}\n" +
        "{\"event\":\"元宵上有只虫子，怎么赶都赶不走\",\"label\":\"#0161\",\"options\":[{\"option\":[\"转身回家\",\"元宵+1（好友显示：被偷了）\",\"无奖惩（好友显示：被人守护了）\"]},{\"option\":[\"去别家转转\",\"“扇风侠”称号3天（好友显示：被人守护了）\"]},{\"option\":[\"后台反馈\",\"扇子+30（好友显示：被人守护了）\"]}]}\n" +
        "{\"event\":\"你看到了一瓶盐\",\"label\":\"#0162\",\"options\":[{\"option\":[\"给他的元宵加盐\",\"元宵+1（好友显示：被偷了）\"]},{\"option\":[\"给火堆加盐\",\"扇子+10（好友显示：被人守护了）\"]},{\"option\":[\"吃掉盐\",\"元宝+30（好友显示：被人守护了）\"]}]}\n" +
        "{\"event\":\"你见这是个鸳鸯锅，主人问你做法如何\",\"label\":\"#0163\",\"options\":[{\"option\":[]},{\"option\":[\"扇子+30\",\"营业额-1w\"]},{\"option\":[\"给我加麻加辣\",\"黄金元宵+1（好友显示：被偷了）\",\"10分钟内收益率-50%（好友显示：被人守护了）\"]},{\"option\":[\"天下火锅无出其右\",\"元宵+1（好友显示：被偷了）\",\"元宝+30（好友显示：被人守护了）\"]}]}\n" +
        "{\"event\":\"元宵成精了，你与元宵精搏斗\",\"label\":\"#0164\",\"options\":[{\"option\":[\"战胜元宵精，夺走它身子\",\"烟花+30\",\"营业额+1w(或5w)\",\"营业额-5k\"]},{\"option\":[\"不打不相识，它想与你同去\",\"收益率+5%\"]},{\"option\":[\"你被元宵精打得头破血流\",\"七彩元宵+1\"]}]}\n" +
        "{\"event\":\"隔壁汤圆卖得好，你决定\",\"label\":\"#0165\",\"options\":[{\"option\":[\"爬上墙偷看\",\"营业额-5k\"]},{\"option\":[\"伪装成顾客过去买一包\",\"收益率+30%\"]},{\"option\":[\"跑去对面后厨查看\",\"收益率-10%\"]}]}\n" +
        "{\"event\":\"他看到你鬼鬼祟祟的不像好人，便扬言要举报封你的号，你只好\",\"label\":\"#0166\",\"options\":[{\"option\":[\"跟他一起玩英雄杀\",\"七彩元宵+1\"]},{\"option\":[\"捂住他的眼睛试图逃跑\",\"元宵-3\"]},{\"option\":[\"先把自己举报了\",\"煮好3个元宵\"]}]}\n" +
        "{\"event\":\"初三赶集，看到小贩你上前咨询。决定\",\"label\":\"#0167\",\"options\":[{\"option\":[\"直接购买\",\"10分钟内收益率+50%\"]},{\"option\":[\"劝退他人\",\"营业额-5k\"]},{\"option\":[\"复购反馈\",\"黄金元宵+1\"]}]}\n" +
        "{\"event\":\"林冲为何被逼上梁山，你决定\",\"label\":\"#0168\",\"options\":[{\"option\":[\"压降\",\"元宵-1\"]},{\"option\":[\"高压\",\"七彩元宵+1\"]},{\"option\":[\"电压\",\"10分钟内收益率-50%\"]}]}\n" +
        "{\"event\":\"摊位上只剩下三个面具盲盒，你决定戴上\",\"label\":\"#0169\",\"options\":[{\"option\":[\"左边的面具\",\"煮好所有元宵\"]},{\"option\":[\"中间的面具\",\"1个元宵成熟时间-30分钟\"]},{\"option\":[\"右边的面具\",\"“壮汉”称号3天&七彩元宵+1\"]}]}\n" +
        "{\"event\":\"你煮元宵煮累了决定出去串门，发现大家连做元宵都在内卷，于是你\",\"label\":\"#0170\",\"options\":[{\"option\":[\"加快了做元宵的速度\",\"收益率+10%\"]},{\"option\":[\"降低了卖元宵的价格\"]},{\"option\":[\"偷工减料以减少成本\"]}]}\n" +
        "{\"event\":\"你突然听到这么一句，有点懵，这声音仿佛有奇特的诱惑力，你内心纠结不已，最终决定\",\"label\":\"#0171\",\"options\":[{\"option\":[\"一探究竟\",\"无奖惩\"]},{\"option\":[\"报警举报\",\"黄金元宵+1\"]},{\"option\":[\"当没听到\",\"元宝+30\"]}]}\n" +
        "{\"event\":\"他一个人在家正无聊呢，看到你不请自来，就邀请你一起搞点活动，你决定和他一起\",\"label\":\"#0172\",\"options\":[{\"option\":[\"做元宵\",\"收益率+10%\"]},{\"option\":[\"喝茶\",\"收益率-8%\"]},{\"option\":[\"玩英雄杀\",\"七彩元宵+1\"]}]}\n" +
        "{\"event\":\"你在路边看到了一只小猫咪，它好像很久没吃东西了，你决定\",\"label\":\"#0173\",\"options\":[{\"option\":[\"喂它一个元宵\",\"换将卡+1\"]},{\"option\":[\"抱它回家\",\"收益率+50%\"]},{\"option\":[\"给它一脚\",\"收益率-10%\"]}]}\n" +
        "{\"event\":\"他拿出三个盒子，摆在一排让你选一个，你决定打开\",\"label\":\"#0174\",\"options\":[{\"option\":[\"七彩的盒子\",\"七彩元宵+1\"]},{\"option\":[\"金色的盒子\",\"收益率-15%\"]},{\"option\":[\"黑色的盒子\",\"元宝+30\"]}]}\n" +
        "{\"event\":\"锅里的元宵煮好了你把火关掉，突然出现一只七彩鸟叼走了你的元宵，你追出去发现鸟飞进了一座古风建筑里，你决定\",\"label\":\"#0175\",\"options\":[{\"option\":[\"翻墙进去一探究竟\",\"煮好3个元宵\"]},{\"option\":[\"敲门问一下主人家\",\"七彩元宵+1\"]},{\"option\":[\"把七彩鸟喊出来\",\"收益率-15%\"]}]}\n" +
        "{\"event\":\"这个家伙瘫坐在墙角，手里拿着一个笋，看着不太聪明的亚子。你走上前\",\"label\":\"#0176\",\"options\":[{\"option\":[\"抢走了它手里的笋\",\"元宵-3\"]},{\"option\":[\"给它拍了张照\",\"七彩元宵+1\"]},{\"option\":[\"请它吃元宵\",\"藏宝图+3\"]},{\"option\":[\"拍了拍它的头\",\"收益率+8%\"]}]}\n" +
        "{\"event\":\"看着家里的冰锅冷灶，你决定\",\"label\":\"#0177\",\"options\":[{\"option\":[\"去父母家蹭饭吃\",\"黄金元宵+1\"]},{\"option\":[\"去外面饭店下馆子吃一顿\",\"元宝+30\"]},{\"option\":[\"约几个朋友一起做饭吃\",\"元宝+30\"]},{\"option\":[\"算了，饿一顿也没事\",\"黄金元宵+1\"]}]}\n" +
        "{\"event\":\"你循声望去，看到一只小狗，它发现了鬼鬼祟祟的你，并冲你龇牙咧嘴，你眉头一皱\",\"label\":\"#0178\",\"options\":[{\"option\":[\"跟狗道歉转身上了门\",\"元宵+9\"]},{\"option\":[\"问它：“我今年旺不旺！”\",\"10分钟内收益率-50%\"]},{\"option\":[\"问它：“我今年旺不旺？”\"]},{\"option\":[\"抓起狗勾的尾巴咬了一口\"]}]}\n" +
        "{\"event\":\"河神问你掉的是金元宵还是银元宵还是七彩元宵呢，你想了想，回道：\",\"label\":\"#0179\",\"options\":[{\"option\":[\"金元宵\",\"元宝+30\"]},{\"option\":[\"银元宵\"]},{\"option\":[\"七彩元宵\",\"七彩元宵+1\"]},{\"option\":[\"我就要我的糯米元宵\",\"元宵+9\"]}]}\n" +
        "{\"event\":\"到你面前就喊你师父，但是你好像没有收过徒弟，于是你说\",\"label\":\"#0180\",\"options\":[{\"option\":[\"我没你这样的徒弟\",\"收益率-8%\"]},{\"option\":[\"八戒你来啦\",\"收益率+30%\"]},{\"option\":[\"乖徒儿快起来吧\",\"黄金元宵+1\"]},{\"option\":[\"救命啊！非礼啊！\",\"“富豪”称号3天\"]}]}\n" +
        "{\"event\":\"对方凶神恶煞的把你拦下，看来你今天不留下点什么是走不掉了，你决定\",\"label\":\"#0181\",\"options\":[{\"option\":[\"把元宵给他\",\"元宵+9\"]},{\"option\":[\"把钱给他\"]},{\"option\":[\"跟他拼了\"]},{\"option\":[\"给他讲笑话\",\"收益率+100%\"]}]}\n" +
        "{\"event\":\"热情好客的策划为你提供了3种不同口味的汤圆，并悄悄告诉你油炸汤圆才是最好吃的。你决定\",\"label\":\"#0182\",\"options\":[{\"option\":[\"听从劝说选择油炸的\",\"七彩元宵+1\"]},{\"option\":[\"水煮才是最爱\"]},{\"option\":[\"小孩子才做选择，我全都要\"]},{\"option\":[\"以吃饱为由委婉拒绝\"]}]}\n" +
        "{\"event\":\"一个古风少年\",\"label\":\"#0183\",\"options\":[{\"option\":[\"欧阳修\"]},{\"option\":[\"元宵\",\"煮好全部\"]},{\"option\":[\"姜石白\",\"王守仁\"]}]}";

    private static List<String> eventList;
    private static void loadEventList(){
        eventList = new ArrayList<>();
        String text = LanternUtils.totalPlainText;
        String[] events = text.split("\n");
        for(int i=0;i<events.length;i++){
            if(events[i].length()<5)//omit illegal fragment
                continue;
            try{
                LanternEvent event = JsonUtils.fromJson(events[i]);
                eventList.add(events[i]);
            }catch (Exception e){
                log.error("加载题库失败：%s",events[i]);
            }
        }
    }
    public static List<String> getEventList(){
        if(LanternUtils.eventList==null || eventList.size()<=0){
            LanternUtils.loadEventList();
        }
        return LanternUtils.eventList;
    }
    public static boolean addNewLanternEvent(LanternEvent e){
        int idx = e.getLabel();
        if(idx<eventList.size()){
            eventList.set(idx,LanternUtils.toJsonString(e));
            return true;
        }else if(idx==9999){
            e.setLabel(String.format("#%04d",eventList.size()));
            eventList.add(LanternUtils.toJsonString(e));
            return true;
        }else{
            return false;
        }
    }
    public static String toJsonString(LanternEvent e){
        String text = JsonUtils.toJson(e);
        return StringUtils.trimAllWhitespace(text);
    }
    public static Object toJsonObject(String s){
        return JsonUtils.fromJson(s);
    }
    public static LanternEvent toLanternEvent(String s){
        return (LanternEvent)JsonUtils.fromJson(s);
    }

}
